# -*- coding: utf-8 -*-

import random
import re

two_char_words = ['朱砂', '天下', '杀伐', '人家', '韶华', '风华', '繁华', '血染', '墨染', '白衣', '素衣', '嫁衣',
                  '倾城', '孤城', '空城', '旧城', '旧人', '伊人', '心疼', '春风', '古琴', '无情', '迷离', '奈何', '断弦', '焚尽',
                  '散乱', '陌路', '乱世', '笑靥', '浅笑', '明眸', '轻叹', '烟火', '一生', '三生', '浮生', '桃花', '梨花', '落花',
                  '烟花', '离殇', '情殇', '爱殇', '剑殇', '灼伤', '仓皇', '匆忙', '陌上', '清商', '焚香', '墨香', '微凉', '断肠',
                  '痴狂', '凄凉', '黄梁', '未央', '成双', '无恙', '虚妄', '凝霜', '洛阳', '长安', '江南', '忘川', '千年', '纸伞',
                  '烟雨', '回眸', '公子', '红尘', '红颜', '红衣', '红豆', '红线', '青丝', '青史', '青冢', '白发', '白首', '白骨',
                  '黄土', '黄泉', '碧落', '紫陌']

four_char_words = ['情深缘浅', '情深不寿', '莫失莫忘', '阴阳相隔', '如花美眷', '似水流年',
                   '眉目如画', '曲终人散', '繁华落尽', '不诉离殇', '一世长安']

sentence_model = ['{xx[0]}，{xx[1]}，{xx[2]}了{xx[3]}。', '{xxxx[0]}，{xxxx[1]}，不过是一场{xxxx[2]}。',
                  '你说{xxxx[0]}，我说{xxxx[1]}，最后不过{xxxx[2]}。', '{xx[0]}，{xx[1]}，许我一场{xxxx[0]}。',
                  '一{xx[0][0]}一{xx[0][1]}一{xx[1]}，半{xx[2][0]}半{xx[2][1]}半{xx[3]}。',
                  '你说{xxxx[0]}{xxxx[1]}，后来{xxxx[2]}{xxxx[3]}。',
                  '{xxxx[0]}，{xxxx[1]}，终不敌{xxxx[2]}。']


def generate_sentence():
    random.shuffle(two_char_words)
    random.shuffle(four_char_words)
    return random.choice(sentence_model).format(xx=two_char_words, xxxx=four_char_words)


if __name__ == '__main__':
    for i in range(50):
        s = generate_sentence()
        print(s)
